### Python Programming 
<img style = "position:absolute; TOP:0px; LEFT:840px; WIDTH:250px; HEIGHT:65px"  src ="https://drive.google.com/uc?export=view&id=1EnB0x-fdqMp6I5iMoEBBEuxB_s7AmE2k" />

# Unit 4: Data Manipulation 
## In This Lesson You Will...
- Sort and filter a list of objects
- Open and read files from disk
- Parse data from files into native Python data types
- Compute properties of imported data

## File Input & Output

File input and output are essential tools to know when operating Python for data science.
Python's built in functions allow for data import to happen with ease. 

Let's first explore the _open_ function in Python. When we call the open function on a specific file, we need to save the returned value to a variable. This variable will hold a **file object** that contains information about the file and  methods to read/write to the file.

To use the _open_ function correctly, we must provide the function a file path and the mode we want our file to open in. The general syntax is as followed:

```py
file_object = open("file path", "mode")
```

>**Note**: If the file does not exist when calling the open function, it will generate a new file with that name for you. 

#### Modes
<div style="float:left">
    <img src='https://drive.google.com/uc?view=export&id=1MhI3IowP9BRKL0LEwsDr_qA6u9w3H2P2' />
</div>

### Using the Open Function

Run the cell below to generate a text file called "hey_brainstation.txt".

In [1]:
#here we are generating and opening a file in write mode
file = open ("hey_brainstation.txt","w")

### Writing to a File

To add content to a file, we can simply use the .write() method and pass in the content you want to add. Run the cell below to add text to our 'hey_brainstation.txt' file.

In [2]:
#now let's explore writing some lines into the file
file.write("Welcome to BrainStation's ")
file.write("Python for Data Science ")
file.write("Training Course!")
file.close()

When opening our 'hey_brainstation.txt', you can see that each .write() invocation did not write to an individual line. Instead, each set of string characters are appended to the previous string. If we wanted to have each `write` appear on a new line, we will need to specify the new-line character `\n` at the point where we want our string to appear on a new line. 

Using our example above, let's add 'Today you will learn:' on a new line. We will need to use the `'a'` mode when opening the file to accomplish this. If we used the `'w'` mode, we will overwrite the original content.

In [3]:
file = open ("hey_brainstation.txt","a")
file.write('\nToday you will learn:')
file.close()

### Close Function

You may have noticed the close function being called at the end of the code block above. It is best practice to always close your file once you have finished using it. When calling the open function, it does not automatically close the opened file at the end of a code block. If the file is not closed, you run the risk of slowing your program thus making your code less efficient.

### Methods to Reading File Content

#### Read Method
Using the .read() method, all contents of a file is returns as one string. If you pass our read method a number parameter, it will return the `nth` amount of string characters. It is important to note that a space is considered a character.

In [4]:
# All Content
file = open("hey_brainstation.txt","r")
print (file.read())
file.close()

Welcome to BrainStation's Python for Data Science Training Course!
Today you will learn:

In [5]:
# Speccific Number of Characters
file = open("hey_brainstation.txt","r")
print (file.read(7))
file.close()

Welcome

#### Readlines Method
Using **.readlines(  )** will output a list of each line in our file. Each time our file contains a new-line or `\n` character, it is added to the list.

In [6]:
#readlines
file = open("hey_brainstation.txt","r")
print(file.readlines())
file.close()

["Welcome to BrainStation's Python for Data Science Training Course!\n", 'Today you will learn:']

#### Readline Method
Using **readline( )** will provide a string with the next line of the file with all text up to and including the newline character.

In [7]:
file = open("hey_brainstation.txt","r")
file.readline()

"Welcome to BrainStation's Python for Data Science Training Course!\n"

### Splitting Lines 

The **.split() method** allows you to choose the character you want to separate a string by. The returned output of calling the .split() method is a list of strings segmented at the position the passed character was located at. If a character is not passed in, the string will be split at every space character.

In [8]:
file = open("hey_brainstation.txt", "r")
content = file.read()
print(content.split())
file.close()

['Welcome', 'to', "BrainStation's", 'Python', 'for', 'Data', 'Science', 'Training', 'Course!', 'Today', 'you', 'will', 'learn:']

Let's look at the output if you decide to split at every 'a' character.

In [9]:
file = open('hey_brainstation.txt')
content = file.read()
split_content = content.split('a')
print(split_content)

['Welcome to Br', 'inSt', "tion's Python for D", 't', ' Science Tr', 'ining Course!\nTod', 'y you will le', 'rn:']

You may have noticed that the 'a' character is no longer in our segmented strings. You can think of the split method as a function that replaces the specified character with a comma and returns a list. If we wanted to take each string a put it back together, we can use the .join() method and pass in the character you want to join each string with. In our most recent example above, we want to join our strings with the 'a' character.

In [10]:
print('a'.join(split_content))
file.close()

Welcome to BrainStation's Python for Data Science Training Course!
Today you will learn:

## Activity File Input & Output

You are provided a secret message encoded in a format that humans can't read. The secret message is stored inside a file called `secret.txt` (download [here](https://drive.google.com/open?id=1Mu0ThgTUXhp2B7DFzLlrGIfAmh78BydD)). Using Python's `open` function and the resulting file object, read the contents of the file and use the provided `decode` function to decode the secret message. `decode` returns a string, so you will have to print it yourself.

In [21]:
def decode(message):
    import base64
    return base64.b64decode(message)

# Write Code Here
secret_file = open('secret.txt') #r is default if mode is not specified
print(decode(secret_file.read()))
secret_file.close()

b"You'll eat more than 35,000 cookies in your lifetime (hopefully)."

### Sorted Method

There may come a time when you need to sort a piece of data, the .sorted() method gives us the ability to sort a collection of orderable elements. A list is considered to be an orderable data type while a dictionary is considered to be unorderable. The .sorted() method will take a list, arrange it according to the specified criteria and return a new list instance leaving the original unchanged.

In [22]:
nums = [5, 2, 3, 1, 4]
result = sorted(nums)

print("Sorted:", result)
print("Original:",nums)

names = ["Bob", "Amy", "Phil", "Alex"]
result2 = sorted(names)

print("Sorted:", result2)
print("Original:", names)

Sorted: [1, 2, 3, 4, 5]
Original: [5, 2, 3, 1, 4]
Sorted: ['Alex', 'Amy', 'Bob', 'Phil']
Original: ['Bob', 'Amy', 'Phil', 'Alex']

##### Advanced Sorting

The sorted method has two parameters that can be used to facilitate more advanced sorting based on predetermined criteria. 

**key** parameter: The key parameter needs to be passed a function to return a comparison key for each element.

**reverse** parameter: Sort in reverse order (to control ascending vs descending)

```py
sorted(data, key=function, reverse=boolean)
```

In [23]:
names = ["Frank", "Jen", "Phil", "Pat"]

# sort names list based on the length of each name
sorted_names_by_length = sorted(names, key=len)
print(sorted_names_by_length)

sorted_names_by_length_descending = sorted(names, key=len, reverse=True)
print(sorted_names_by_length_descending)

['Jen', 'Pat', 'Phil', 'Frank']
['Frank', 'Phil', 'Jen', 'Pat']

## NumPy and Pandas

Pandas and NumPy are two very useful Python libraries commonly used in Data Science and Data Analytics.

Typically, they are imported as pd and np respectively.

```py
import pandas as pd
import numpy as np
```

### Pandas

Pandas is a great tool for taking a csv file or SQL database to create an object with rows and columns. This is known as a **DataFrame**. Think of a DataFrame to be similar to an excel spreadsheet or table. We can create a DataFrame from our own dataset or from importing a csv file.

First, let's create a DataFrame from our own dataset.

#### Create DataFrame from Own Dataset

In [28]:
import pandas as pd
import numpy as np

raw_data = {
    'first_name': ['Dave', 'Tamara', 'Ashley', 'Arvin', 'Emma'],
    'last_name': ['Stevens', 'Jacobson', 'Davis', 'Miller', 'Cook'],
    'age': [42, 52, 36, 24, 73],
    'TestScore1': [92, 44, 67,75, 83],
    'TestScore2': [99, 64, 72, 75, 85]
}
test_scores = pd.DataFrame(raw_data, columns = ['first_name', 'last_name', 'age', 'TestScore1', 'TestScore2'])
test_scores

  first_name last_name  age  TestScore1  TestScore2
0       Dave   Stevens   42          92          99
1     Tamara  Jacobson   52          44          64
2     Ashley     Davis   36          67          72
3      Arvin    Miller   24          75          75
4       Emma      Cook   73          83          85

#### Create DataFrame from Imported CSV File

Use the .read_csv() method and pass in the file path to our csv file.

```py
import pandas as pd
df = pd.read_csv('file-path.csv')
```

Note: df is the variable that will hold/represent our DataFrame. 

#### Pandas: Indexing

Indexing is used to read and modify our DataFrame. We can index by doing the following:
- Basic Indexing: ```py dataframe[column-name]```
- Index by Label: ```py dataframe.loc[row, column]```
- Index by Integer: ```py dataframe.iloc[row, column]```

In [31]:
# Basic
print("List of Student Names")
first_names = test_scores['first_name']
print(first_names)

print("Increased Test Score by 2")
test_scores['TestScore1'] += 2 #Running this block increases score by 2 each time
print(test_scores['TestScore1'])

# Access First Student will Index by Integer
first_student = test_scores.iloc[0]
print("First Student Data")
print(first_student)

List of Student Names
0      Dave
1    Tamara
2    Ashley
3     Arvin
4      Emma
Name: first_name, dtype: object
Increased Test Score by 2
0    98
1    50
2    73
3    81
4    89
Name: TestScore1, dtype: int64
First Student Data
first_name       Dave
last_name     Stevens
age                42
TestScore1         98
TestScore2         99
Name: 0, dtype: object

#### Pandas: Advanced Indexing with Slicing

Slicing gives us access to a subset of data in our DataFrame. The overall syntax for slicing is very simple but can be very powerful especially for cases where we want to:
- keep the first and last rows
- keep every nth row
- access a section of data

The general syntax is as follows:
```py
dataframe[begin:end:step]
dataframe.loc[row_begin:row_end:row_step, col_begin:col_end:col_step]
dataframe.iloc[row_begin:row_end:row_step, col_begin:col_end:col_step]

```

<img src='https://drive.google.com/uc?view=export&id=1mV4QAv21ID_9lLX86xqm7z_ndaSa1yhQ' />

Let's do some slicing on our test_scores DataFrame

In [32]:
# Slice until index 3
test_scores[:3]

  first_name last_name  age  TestScore1  TestScore2
0       Dave   Stevens   42          98          99
1     Tamara  Jacobson   52          50          64
2     Ashley     Davis   36          73          72

In [33]:
# Slice from the end back 3
test_scores[-3:]

  first_name last_name  age  TestScore1  TestScore2
2     Ashley     Davis   36          73          72
3      Arvin    Miller   24          81          75
4       Emma      Cook   73          89          85

In [34]:
# Slice every other row
test_scores[::2]

  first_name last_name  age  TestScore1  TestScore2
0       Dave   Stevens   42          98          99
2     Ashley     Davis   36          73          72
4       Emma      Cook   73          89          85

#### Pandas: Sorting

Using the simple .sort_values() method is the easiest way to sort data. Refer to the table below for all parameters available.

<img src='https://drive.google.com/uc?view=export&id=1bn9o3oBgSz5SAEx7EJjFpUqf7bxnakWh' />

In [35]:
#Let's sort the values by TestScore1
test_scores.sort_values(by=['TestScore1'])

  first_name last_name  age  TestScore1  TestScore2
1     Tamara  Jacobson   52          50          64
2     Ashley     Davis   36          73          72
3      Arvin    Miller   24          81          75
4       Emma      Cook   73          89          85
0       Dave   Stevens   42          98          99

In [36]:
test_scores.sort_values(by=['TestScore1'], ascending=False)

  first_name last_name  age  TestScore1  TestScore2
0       Dave   Stevens   42          98          99
4       Emma      Cook   73          89          85
3      Arvin    Miller   24          81          75
2     Ashley     Davis   36          73          72
1     Tamara  Jacobson   52          50          64

#### Pandas: Additional ways to sort

For teaching purposes, it is easy to create a randomized DataFrame, which we can learn to manipulate. 
Typically, we will define our DataFrames as 'df'.

In [37]:
df = pd.DataFrame(np.random.randn(7,7), columns=['A','B','C','D','E','F','G'])
df

          A         B         C         D         E         F         G
0  1.030929  0.804766 -0.148318  0.793244 -0.619554  0.948809  0.624056
1 -1.423480 -1.139170  0.336149 -0.508605  1.050185  2.110333  1.946714
2 -0.746429 -0.229592  0.166277  0.277758  0.220259 -0.635070  0.862115
3  0.911521 -0.209106 -0.202619 -0.417628  0.464785 -0.093956  0.189918
4  1.010034 -1.062626 -1.042431 -0.937690 -0.335082  0.020892 -2.275991
5 -0.726108 -2.742918 -1.288317 -0.355099  0.122563 -0.382977  1.023206
6  1.284221  1.077228  1.052090 -0.423454 -1.967812 -0.105176 -0.147292

You can access the top rows of a data frame using **.head( )** and the bottom using **.tail( )**, if you leave it blank, the display will default at 5 rows

In [38]:
df.head()

          A         B         C         D         E         F         G
0  1.030929  0.804766 -0.148318  0.793244 -0.619554  0.948809  0.624056
1 -1.423480 -1.139170  0.336149 -0.508605  1.050185  2.110333  1.946714
2 -0.746429 -0.229592  0.166277  0.277758  0.220259 -0.635070  0.862115
3  0.911521 -0.209106 -0.202619 -0.417628  0.464785 -0.093956  0.189918
4  1.010034 -1.062626 -1.042431 -0.937690 -0.335082  0.020892 -2.275991

In [39]:
df.tail(1) #displays bottom row of data only

          A         B        C         D         E         F         G
6  1.284221  1.077228  1.05209 -0.423454 -1.967812 -0.105176 -0.147292

Slicing rows in a dataframe is very easy!

The key is to remember that Python is a **zero-index** language.

- The below image shows what position each letter in the word "digital" is positioned depending on the index

<img src = "https://drive.google.com/uc?export=view&id=1CDMS-KTB550XiG_9Y9kCRCSYxxMK8jtn" height = "500" width = "300" align="left" />


Let's only show the rows labelled 5 and 6!

In [41]:
df[5:7] #[5:6] would only show row 5 (6th row since zero index)

          A         B         C         D         E         F         G
5 -0.726108 -2.742918 -1.288317 -0.355099  0.122563 -0.382977  1.023206
6  1.284221  1.077228  1.052090 -0.423454 -1.967812 -0.105176 -0.147292

#### Pandas: Concatenation
Concatenation essentially glues the DataFrames together. 
The dimension on which you want to concatenate can be selected using **.concat** and pass in the list of DataFrames to concatenate together. 
Let's take a look with the below example, with historical data from Iceland's consumer price index and harmonized inflation rate https://www.inflation.eu/inflation-rates/iceland/historic-inflation/cpi-inflation-iceland.aspx:

In [42]:
import pandas as pd
df1 = pd.DataFrame({
    "CPI_Dec-Dec":[3.72,1.86,1.90,2.02,0.83,4.14],
    "Average_CPI":[3.15,2.68,1.77,1.69,1.63,2.05],
    "HICP":[1.98,-1.02,-0.11,0.72,-0.4,3.68]}, 
    index = [2018,2017,2016,2015,2014,2013])
df1

      CPI_Dec-Dec  Average_CPI  HICP
2018         3.72         3.15  1.98
2017         1.86         2.68 -1.02
2016         1.90         1.77 -0.11
2015         2.02         1.69  0.72
2014         0.83         1.63 -0.40
2013         4.14         2.05  3.68

In [43]:
df2 = pd.DataFrame({
    "CPI_Dec-Dec":[4.20,5.25,2.48,7.49,18.14,5.83],
    "Average_CPI":[5.20,4.00,5.44,12.16,12.63,5.07],
    "HICP":[5.12,5.25,3.49,11.3,21.03,3.46]},
    index = [2012,2013,2014,2015,2016,2017])
df2

      CPI_Dec-Dec  Average_CPI   HICP
2012         4.20         5.20   5.12
2013         5.25         4.00   5.25
2014         2.48         5.44   3.49
2015         7.49        12.16  11.30
2016        18.14        12.63  21.03
2017         5.83         5.07   3.46

In [44]:
concat = pd.concat([df1,df2],axis=1)
 
print(concat) # do display instead of print to print nicer tables

      CPI_Dec-Dec  Average_CPI  HICP  CPI_Dec-Dec  Average_CPI   HICP
2012          NaN          NaN   NaN         4.20         5.20   5.12
2013         4.14         2.05  3.68         5.25         4.00   5.25
2014         0.83         1.63 -0.40         2.48         5.44   3.49
2015         2.02         1.69  0.72         7.49        12.16  11.30
2016         1.90         1.77 -0.11        18.14        12.63  21.03
2017         1.86         2.68 -1.02         5.83         5.07   3.46
2018         3.72         3.15  1.98          NaN          NaN    NaN

What happened above?
There are bunch of missing values!
Missing values occur when the dataframes do not have values for all of the indices you are trying to concatenate on.
It is important to make sure you have all of the information lining up correctly when you join or concatenate on the axis.

#### Pandas: Cleaning Data

Data Cleaning / Data Cleansing is done to detect and correct or remove corrupted data. Data cleansing can be done using pure Python but Pandas makes this task much easier.

Some common cleansing techniques for removing NaN elements are as followed:

- Rows with any missing data: `dataframe.dropna()`
- Rows with all elements missing: `dataframe.dropna(how="all")`
- Rows with missing elements for specific columns: `dataframe.dropna(subset=["name", "age"])`
- Columns with any missing element: `dataframe.dropna(axis="columns")`

For our dataframe above, we can simply use the .dropna() method to remove any row that contains a NaN value in any column.

In [45]:
concat.dropna()

      CPI_Dec-Dec  Average_CPI  HICP  CPI_Dec-Dec  Average_CPI   HICP
2013         4.14         2.05  3.68         5.25         4.00   5.25
2014         0.83         1.63 -0.40         2.48         5.44   3.49
2015         2.02         1.69  0.72         7.49        12.16  11.30
2016         1.90         1.77 -0.11        18.14        12.63  21.03
2017         1.86         2.68 -1.02         5.83         5.07   3.46

If we only wanted to only remove rows that had a NaN value in a specific column, we can use the .dropna() method and specify which column we want to target with the subset parameter. For our DataFrame above, lets target the 'HICP' column.

In [46]:
concat_df = pd.concat([df1,df2],axis=1)
concat_df.dropna(subset=["Average_CPI"])

      CPI_Dec-Dec  Average_CPI  HICP  CPI_Dec-Dec  Average_CPI   HICP
2013         4.14         2.05  3.68         5.25         4.00   5.25
2014         0.83         1.63 -0.40         2.48         5.44   3.49
2015         2.02         1.69  0.72         7.49        12.16  11.30
2016         1.90         1.77 -0.11        18.14        12.63  21.03
2017         1.86         2.68 -1.02         5.83         5.07   3.46

## Activity: Pandas

- Download the `stock.csv` file [here](https://drive.google.com/file/d/1vbXXDjNI6FvgA61l93OnTRvLZhkUgo3N) and import the data as a Pandas DataFrame. Assign the DataFrame to a variable called `stocks_df`. 
- Sort the stocks DataFrame by their name
- Once sorted, print the first stock
- Slice the DataFrame to print the first 3 stocks
- Print the data for the 3 stocks with the highest prices
    - **Hint:** You will need to sort and slice.

In [66]:
# Write Code Here
import pandas as pd
stocks = pd.read_csv('stocks.csv')
display(stocks)
sorted_stocks = stocks.sort_values(by=['name'])
display(sorted_stocks)
display(sorted_stocks.head(1)) #same as sorted_stocks[0:1]
display(stocks[-5:-2]) #same as stocks[0:3] since length is 5
sort_price_stocks = stocks.sort_values(by=['price'], ascending = False)
display(sort_price_stocks[0:3])

                                              name symbol  price
0                              ArcBest Corporation   ARCB  29.53
1                      Orexigen Therapeutics, Inc.   OREX  11.93
2  VelocityShares Daily Inverse VIX Short-Term ETN    XIV  11.89
3                        Navigant Consulting, Inc.    NCI  28.89
4                      General Communication, Inc.  GNCMA  22.16

                                              name symbol  price
0                              ArcBest Corporation   ARCB  29.53
4                      General Communication, Inc.  GNCMA  22.16
3                        Navigant Consulting, Inc.    NCI  28.89
1                      Orexigen Therapeutics, Inc.   OREX  11.93
2  VelocityShares Daily Inverse VIX Short-Term ETN    XIV  11.89

                  name symbol  price
0  ArcBest Corporation   ARCB  29.53

                                              name symbol  price
0                              ArcBest Corporation   ARCB  29.53
1                      Orexigen Therapeutics, Inc.   OREX  11.93
2  VelocityShares Daily Inverse VIX Short-Term ETN    XIV  11.89

                          name symbol  price
0          ArcBest Corporation   ARCB  29.53
3    Navigant Consulting, Inc.    NCI  28.89
4  General Communication, Inc.  GNCMA  22.16

### NumPy

NumPy is a Python library that enables us to run computations efficiently when forced to deal with large sets of data. The library has built-in functions that enable us to create arrays on information that is easier to manipulation than a traditional list.

Creating a NumPy array is quite easy, simply use the .array() method and pass in the data you would like to transform.

```py
import numpy as np
np.array([1, 2, 3, 4, 5])
```

To create a NumPy array from a Pandas DataFrame, specify `.values` on the DataFrame. Only the values in the DataFrame will be returned and the label axes are removed.
```py
import pandas as pd
df = pd.DataFrame([1, 2, 3, 4, 5])
numpy_array = df.values
```

#### NumPy Computation Tools: Universal Functions
NumPy library contains functions that aid in performing computations on arrays. If we wanted to add two arrays together, use the .add() method and it will return a new array with values added together at each corresponding index. Refer to the chart below for Universal Function examples.
    
<img src='https://drive.google.com/uc?view=export&id=1bARLx8SYDEsanXCYvpa4nLiOYJirMZxN' />

#### NumPy: Indexing 

Indexing an array is similar to Pandas and list as they are indexed beginning at zero.

On a one-dimensional array simply index by specifying the array name and a set of square brackets with the index of the value you want to retrieve inside.

In [58]:
import numpy as np

# One-Dimensional Array
one_d = np.array([1,2,3,4,5])
third_val = one_d[2]
print(third_val)

3

Indexing an array with more than one-dimension requires a set of square brackets for every level you want to traverse. For example, if you want to retrieve data from the second dimension in an array you will need two sets of square brackets with a value in each. Think of a two-dimensional array as a table with rows and columns or x and y coordinates.

In [59]:
two_d = np.array([[1,2,3,4,5],[6,7,8,9,10],[11,12,13,14,15]])

# If we want to retrieve the number 9, we will have to go to the second array to the fourth position.
# Remember, arrays are zero based.
number_nine = two_d[1][3]

print(number_nine)

9

#### NumPy: Slicing

Refer to the slicing chart under **Pandas: Advanced Indexing with Slicing** as the techniques are the same across both datasets.

## Activity: Cleaning Data

You're working with a dataset that contains information about people's name and age. Your data set is incomplete and contains some null values. Requirements state that you are not to perform computations on any records that are not complete. Compute the mean age of all valid records. 
 - Use the .mean() method provided by the Pandas library

In [64]:
import pandas as pd

df = pd.DataFrame({
    'last_name': ['Smith', None, 'Brown', 'Apricot', 'Anders', None, 'Appleseed', 'Ranger'], 
    'first_name': [None, 'Zach', 'Erin', 'Alex', None, 'Kelsey', 'Finley', 'Jen'], 
    'age': [35, 45, None, 19, 21, 30, 42, 32]
})

# Write Code Here
print(df)
cleaned = df.dropna()
display(cleaned)
print(cleaned['age'].mean())

   last_name first_name   age
0      Smith       None  35.0
1       None       Zach  45.0
2      Brown       Erin   NaN
3    Apricot       Alex  19.0
4     Anders       None  21.0
5       None     Kelsey  30.0
6  Appleseed     Finley  42.0
7     Ranger        Jen  32.0

   last_name first_name   age
3    Apricot       Alex  19.0
6  Appleseed     Finley  42.0
7     Ranger        Jen  32.0

31.0

<div id="container" style="position:relative;">
    <div style="position:relative; float:right"><img style="height:25px""width: 50px" src ="https://drive.google.com/uc?export=view&id=14VoXUJftgptWtdNhtNYVm6cjVmEWpki1" />
    </div>
</div>